tests/fvModels/case/constant/tStar
(
    (-9999 757.375)
    (0.000 757.375)
    (1.000 929.250)
    (99999 929.250)
)